# ExternalGeometryId Class

---
This class represents an identifier for geometry from external sources.
SystemObject Autodesk.Revit.DBExternalGeometryId
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ExternalGeometryId : IDisposable

    Public Class ExternalGeometryId
    	Implements IDisposable

    public ref class ExternalGeometryId : IDisposable

    type ExternalGeometryId =
        class
            interface IDisposable
        end
The ExternalGeometryId type exposes the following members.
| Name| Description
---|---|---
| ExternalGeometryId|  Constructs an ExternalGeometryId object holding the given external geometry identifier.
Top
| Name| Description
---|---|---
| Id|  External geometry identifier.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ExternalGeometryId
| Equals|  Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object))
| GetHashCode|  Gets the hash code. (Overrides ObjectGetHashCode)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| IsValidExternalGeometryId|  Checks whether a given string represents a valid ExternalGeometryId or not.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
| Name| Description
---|---|---
| Equality(ExternalGeometryId, ExternalGeometryId)| Determines whether two ExternalGeometryIds are the same.
| Inequality(ExternalGeometryId, ExternalGeometryId)| Determines whether two ExternalGeometryIds are different.
Top
#### Reference
Autodesk.Revit.DB Namespace